# Unit Type Id Thousand British Thermal Units Property

Source: https://www.revitapidocs.com/2026/eb4ae335-408f-b5be-6cc9-4f4580fc2964.htm

---

| Unit Type Id Thousand British Thermal Units Property |
| --- |

Thousand British thermal units.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ThousandBritishThermalUnits { get; }
```

```
Public Shared ReadOnly Property ThousandBritishThermalUnits As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ThousandBritishThermalUnits {
	ForgeTypeId^ get ();
}
```

```
static member ThousandBritishThermalUnits : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

UnitTypeId Class Autodesk.Revit.DB Namespace